In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Load the Data Set From CSV File

In [2]:
df = pd.read_csv('../dataset/basic/Employers_data.csv')
df.head()

,Employee_ID,Name,Age,Gender,Department,Job_Title,Experience_Years,Education_Level,Location,Salary
0,1,Merle Ingram,24,Female,Engineering,Engineer,1,Master,Austin,90000
1,2,John Mayes,56,Male,Sales,Executive,33,Master,Seattle,195000
2,3,Carlos Wille,21,Male,Engineering,Intern,1,Bachelor,New York,35000
3,4,Michael Bryant,30,Male,Finance,Analyst,9,Bachelor,New York,75000
4,5,Paula Douglas,25,Female,HR,Analyst,2,Master,Seattle,70000

### Handle Missing Values

In [3]:
df.isna().sum()
df.fillna(value={'Age': df['Age'].mean(), 'Salary': df['Salary'].median()}, inplace=True)
df.ffill(inplace=True) # Forward Fill
df.bfill(inplace=True) # Backward Fill
df.head()

,Employee_ID,Name,Age,Gender,Department,Job_Title,Experience_Years,Education_Level,Location,Salary
0,1,Merle Ingram,24,Female,Engineering,Engineer,1,Master,Austin,90000
1,2,John Mayes,56,Male,Sales,Executive,33,Master,Seattle,195000
2,3,Carlos Wille,21,Male,Engineering,Intern,1,Bachelor,New York,35000
3,4,Michael Bryant,30,Male,Finance,Analyst,9,Bachelor,New York,75000
4,5,Paula Douglas,25,Female,HR,Analyst,2,Master,Seattle,70000

### Duplicates Removal

In [4]:
df.duplicated().sum()
df.drop_duplicates(inplace=True)

In [5]:
df['Gender'] = df['Gender'].map({'Male': 1, 'Female': 0})
df.head()

,Employee_ID,Name,Age,Gender,Department,Job_Title,Experience_Years,Education_Level,Location,Salary
0,1,Merle Ingram,24,0,Engineering,Engineer,1,Master,Austin,90000
1,2,John Mayes,56,1,Sales,Executive,33,Master,Seattle,195000
2,3,Carlos Wille,21,1,Engineering,Intern,1,Bachelor,New York,35000
3,4,Michael Bryant,30,1,Finance,Analyst,9,Bachelor,New York,75000
4,5,Paula Douglas,25,0,HR,Analyst,2,Master,Seattle,70000

In [6]:
df[['first_name', 'last_name']] = df['Name'].str.split(' ', expand=True)
df.head()

,Employee_ID,Name,Age,Gender,Department,Job_Title,Experience_Years,Education_Level,Location,Salary,first_name,last_name
0,1,Merle Ingram,24,0,Engineering,Engineer,1,Master,Austin,90000,Merle,Ingram
1,2,John Mayes,56,1,Sales,Executive,33,Master,Seattle,195000,John,Mayes
2,3,Carlos Wille,21,1,Engineering,Intern,1,Bachelor,New York,35000,Carlos,Wille
3,4,Michael Bryant,30,1,Finance,Analyst,9,Bachelor,New York,75000,Michael,Bryant
4,5,Paula Douglas,25,0,HR,Analyst,2,Master,Seattle,70000,Paula,Douglas

In [7]:
pd.cut(df['Salary'], bins=4).value_counts()
df['Salary_Bin'] = pd.cut(df['Salary'], bins=4, labels=['Low', 'Medium', 'High', 'Very High'])
df.head()

,Employee_ID,Name,Age,Gender,Department,Job_Title,Experience_Years,Education_Level,Location,Salary,first_name,last_name,Salary_Bin
0,1,Merle Ingram,24,0,Engineering,Engineer,1,Master,Austin,90000,Merle,Ingram,Medium
1,2,John Mayes,56,1,Sales,Executive,33,Master,Seattle,195000,John,Mayes,Very High
2,3,Carlos Wille,21,1,Engineering,Intern,1,Bachelor,New York,35000,Carlos,Wille,Low
3,4,Michael Bryant,30,1,Finance,Analyst,9,Bachelor,New York,75000,Michael,Bryant,Medium
4,5,Paula Douglas,25,0,HR,Analyst,2,Master,Seattle,70000,Paula,Douglas,Low

In [8]:
df_time = pd.read_csv('../dataset/basic/calendar.csv')
df_time['date'] = pd.to_datetime(df_time['date'])
df_time['date'].dt.is_month_end

0          False
1          False
2          False
3          False
4          False
           ...
1393565    False
1393566    False
1393567     True
1393568    False
1393569    False
Name: date, Length: 1393570, dtype: bool

In [9]:
df.groupby('Department').groups
df.groupby('Department').get_group('Sales')

,Employee_ID,Name,Age,Gender,Department,Job_Title,Experience_Years,Education_Level,Location,Salary,first_name,last_name,Salary_Bin
1,2,John Mayes,56,1,Sales,Executive,33,Master,Seattle,195000,John,Mayes,Very High
13,14,Alice Elvin,40,0,Sales,Executive,13,PhD,Chicago,175000,Alice,Elvin,Very High
20,21,Janeen Crume,44,0,Sales,Executive,21,Master,Chicago,170000,Janeen,Crume,Very High
25,26,Susan Kim,26,0,Sales,Analyst,5,Bachelor,Seattle,75000,Susan,Kim,Medium
26,27,Virginia Jean,47,0,Sales,Executive,24,Master,New York,190000,Virginia,Jean,Very High
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9988,9989,Ruby Dowell,24,0,Sales,Analyst,3,Bachelor,San Francisco,65000,Ruby,Dowell,Low
9995,9996,Thomas Rossin,51,1,Sales,Executive,28,Master,Austin,185000,Thomas,Rossin,Very High
9996,9997,Christie King,36,0,Sales,Executive,9,PhD,San Francisco,165000,Christie,King,High
9997,9998,Alfred Keller,57,1,Sales,Executive,30,PhD,New York,200000,Alfred,Keller,Very High
9999,10000,Joan Sorensen,25,0,Sales,Analyst,4,Bachelor,San Francisco,70000,Joan,Sorensen,Low

In [10]:
# Average Salary by Department
df.groupby('Department')[['Salary']].mean().reset_index().sort_values(by='Salary', ascending=False)

    Department         Salary
1      Finance  130376.175549
5        Sales  127309.766327
2           HR  126400.602410
4      Product  116676.334107
3    Marketing  101734.571600
0  Engineering   90680.332739

In [11]:
# Average Salary by Department and Job Title
df.groupby(['Department','Job_Title'])[['Salary']].mean().reset_index().sort_values(by=['Department','Salary'], ascending=False)

     Department  Job_Title         Salary
14        Sales  Executive  183624.557261
13        Sales    Analyst   69282.238443
12      Product    Manager  135328.947368
11      Product   Engineer   99115.990991
10    Marketing    Manager  135305.997552
9     Marketing    Analyst   69542.253521
7            HR  Executive  183131.021195
8            HR    Manager  134935.897436
6            HR    Analyst   69084.033613
4       Finance  Executive  183360.360360
5       Finance    Manager  135333.333333
3       Finance    Analyst   70122.641509
2   Engineering    Manager  135332.792208
0   Engineering   Engineer   99558.521561
1   Engineering     Intern   35801.724138